export type Question = {
  title: string,
  answers: Array<{ label: string, value: number }>
}

export const questions: Question[] = [
  {
    title: "1.",
    answers: [
      {
        label: "Мені не сумно",
        value: 0
      },

      {
        label: "Значну частину часу мені сумно",
        value: 1
      },

      {
        label: "Я увесь час чуюсь сумним, пригніченим",
        value: 2
      },

      {
        label: "Я відчуваю нестерпний сум та тугу ",
        value: 3
      },
    ]
  },

  {
    title: "2. ",
    answers: [
      {
        label: "Я не вважаю, що заслуговую покарання",
        value: 0
      },

      {
        label: "Я допускаю, що заслуговую покарання",
        value: 1
      },

      {
        label: "Я вважаю, що маю бути покараний",
        value: 2
      },

      {
        label: "Я відчуваю, що доля карає мене",
        value: 3
      },
    ]
  },


  {
    title: "3. ",
    answers: [
      {
        label: "Я спокійно думаю про майбутнє",
        value: 0
      },

      {
        label: "Думки про майбутнє викликають в мене занепокоєння більше, ніж раніше",
        value: 1
      },

      {
        label: "Мені нема чого чекати від майбутнього і на що надіятися",
        value: 2
      },

      {
        label: "Я відчуваю, що в моєму майбутньому нема нічого доброго і я нічого не можу змінити",
        value: 3
      },
    ]
  },

  {
    title: "4. ",
    answers: [
      {
        label: "Я не відчуваю себе невдахою",
        value: 0
      },

      {
        label: "В минулому я мав би менше зазнавати невдач",
        value: 1
      },

      {
        label: "Моє життя – це суцільна низка невдач та помилок",
        value: 2
      },

      {
        label: "Я абсолютний невдаха в усьому (навчанні, праці, сімейному житті і т.д.)",
        value: 3
      },
    ]
  },

  {
    title: "5. ",
    answers: [
      {
        label: "Я в основному задоволений тим, ким я є",
        value: 0
      },

      {
        label: "Я втратив впевненість у собі",
        value: 1
      },

      {
        label: "Я розчарований в собі",
        value: 2
      },

      {
        label: "Я не люблю себе",
        value: 3
      },
    ]
  },


  {
    title: "6. ",
    answers: [
      {
        label: "Я отримую задоволення від улюблених занять і речей",
        value: 0
      },

      {
        label: "Я не отримую такого задоволення, як раніше від улюблених занять та речей",
        value: 1
      },

      {
        label: "Я отримую дуже мало задоволення від того, що зазвичай мене тішило",
        value: 2
      },

      {
        label: "Я не можу отримати задоволення від того, що зазвичай мене тішило",
        value: 3
      },
    ]
  },


  {
    title: "7. ",
    answers: [
      {
        label: "Я критикую і звинувачую себе не більше, ніж зазвичай",
        value: 0
      },

      {
        label: "Я більш критичний до себе, ніж зазвичай",
        value: 1
      },

      {
        label: "Я критикую себе за всі свої помилки",
        value: 2
      },

      {
        label: "Я звинувачую себе у всьому поганому, що відбувається",
        value: 3
      },
    ]
  },


  {
    title: "8. ",
    answers: [
      {
        label: "Я не відчуваю відчуття провини",
        value: 0
      },

      {
        label: "Я відчуваю почуття провини за багато речей, зроблених мною",
        value: 1
      },

      {
        label: "Я дуже часто чуюсь поганою людиною і мене мучить відчуття провини",
        value: 2
      },

      {
        label: "Мене мучить постійне відчуття провини",
        value: 3
      },
    ]
  },


  {
    title: "9. ",
    answers: [
      {
        label: "У мене не виникає думок про самогубство",
        value: 0
      },

      {
        label: "У мене бувають думки про самогубство, але я знаю, що не зроблю цього",
        value: 1
      },

      {
        label: "Я хочу вмерти і планую самогубство",
        value: 2
      },

      {
        label: "Якщо б була нагода, я б зробив самогубство",
        value: 3
      },
    ]
  },

  {
    title: "10. ",
    answers: [
      {
        label: "Я не більш неспокійний або збуджений, ніж зазвичай",
        value: 0
      },

      {
        label: "Я відчуваю більше занепокоєння і збудження, ніж зазвичай",
        value: 1
      },

      {
        label: "Я відчуваю таке занепокоєння і збудження, що мені важко сидіти спокійно",
        value: 2
      },

      {
        label: "Я відчуваю таке занепокоєння і збудження, що змушений весь час рухатися або щось робити",
        value: 3
      },
    ]
  },


  {
    title: "11. ",
    answers: [
      {
        label: "Я не плачу більш часто, ніж звичайно",
        value: 0
      },

      {
        label: "Я плачу частіше, ніж звичайно",
        value: 1
      },

      {
        label: "Я плáчу кожен день по кожному незначному приводу",
        value: 2
      },

      {
        label: "Я хочу плакати, але не можу",
        value: 3
      },
    ]
  },

  {
    title: "12. ",
    answers: [
      {
        label: "Я не втратив цікавості до інших людей і занять",
        value: 0
      },

      {
        label: "Люди і речі цікавлять мене менше, ніж раніше.",
        value: 1
      },

      {
        label: "Я значною мірою втратив цікавість до інших людей і занять",
        value: 2
      },

      {
        label: "Мене важко чимось зацікавити",
        value: 3
      },
    ]
  },


  {
    title: "13. ",
    answers: [
      {
        label: "Я не дратуюсь частіше, ніж звичайно",
        value: 0
      },

      {
        label: "Я дратуюся легше, ніж звичайно",
        value: 1
      },

      {
        label: "Я дратуюся значно легше, ніж звичайно",
        value: 2
      },

      {
        label: "Я постійно відчуваю роздратування",
        value: 3
      },
    ]
  },


  {
    title: "14. ",
    answers: [
      {
        label: "Мені не є важче, ніж звичайно приймати рішення",
        value: 0
      },

      {
        label: "Тепер частіше, ніж раніше я зволікаю з прийняттям рішень",
        value: 1
      },

      {
        label: "Мені дуже важко прийняти будь-яке рішення",
        value: 2
      },

      {
        label: "Я не в стані приймати жодних рішень",
        value: 3
      },
    ]
  },


  {
    title: "15. ",
    answers: [
      {
        label: "Мій апетит не змінився",
        value: 0
      },

      {
        label: "Мій апетит дещо знижений у порівнянні зі звичайним",
        value: 1
      },

      {
        label: "Мій апетит дещо підвищений в порівнянні зі звичайним",
        value: 2
      },

      {
        label: "У мене зовсім нема апетиту",
        value: 0
      },
    ]
  },


  {
    title: "16. ",
    answers: [
      {
        label: "Я не відчуваю себе нікчемним",
        value: 0
      },

      {
        label: "Я не відчуваю себе таким же цінним і корисним, як завжди",
        value: 1
      },

      {
        label: "Я відчуваю себе менш цінним, ніж інші",
        value: 2
      },

      {
        label: "Я відчуваю себе повністю нікчемним",
        value: 3
      },
    ]
  },


  {
    title: "17. ",
    answers: [
      {
        label: "Я так само добре можу зосередитися, як завжди",
        value: 0
      },

      {
        label: "Я не можу так само добре зосередитися, як завжди",
        value: 1
      },

      {
        label: "Мені важко довго утримувати увагу на чому-небудь",
        value: 2
      },

      {
        label: "Я не можу зосередитися ні на чому",
        value: 3
      },
    ]
  },


  {
    title: "18. ",
    answers: [
      {
        label: "Я так само енергійний, як зазвичай",
        value: 0
      },

      {
        label: "У мене менше енергії, ніж зазвичай",
        value: 1
      },

      {
        label: "У мене недостатньо енергії, щоб зробити багато чого з того, що потрібно",
        value: 2
      },

      {
        label: "У мене немає сил ні на що",
        value: 3
      },
    ]
  },


  {
    title: "19. ",
    answers: [
      {
        label: "Я втомлююся не більш, ніж зазвичай",
        value: 0
      },

      {
        label: "Я втомлююся значно легше, ніж раніше",
        value: 1
      },

      {
        label: "Через втому я не можу виконувати багато звичних для мене справа",
        value: 2
      },

      {
        label: "Через втому я не можу виконувати більшість звичних для мене справа",
        value: 3
      },
    ]
  },


  {
    title: "20. ",
    answers: [
      {
        label: "Я сплю так само, як завжди",
        value: 0
      },

      {
        label: "Я сплю дещо більше, ніж зазвичай",
        value: 1
      },

      {
        label: "Я сплю значно менше, ніж зазвичай",
        value: 3
      },

      {
        label: "Я буджуся на 1-2 години раніше, ніж звичайно і мені важко знову заснути",
        value: 3
      },
    ]
  },

  {
    title: "21. ",
    answers: [
      {
        label: "Мій інтерес до статевого життя за останній час не зменшився",
        value: 0
      },

      {
        label: "Статеве життя мене цікавить зараз менше, ніж звичайно",
        value: 1
      },

      {
        label: "Мій інтерес до статевого життя значно зменшився",
        value: 2
      },

      {
        label: "Я повністю втратив інтерес до статевого життя",
        value: 3
      },
    ]
  }
];



